app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Rails Introduction Quiz"], ["description", "asdfasdf"], ["created_at", "2015-12-31 19:45:03.614973"], ["updated_at", "2015-12-31 19:45:03.614973"]]
---
  def create
    ##1. Create a new post instance
    @post = Post.new
    ##2. Pass in the parmeters from the form
    @post.title = params[:title]
    @post.description = params[:description]
    ##3. Save to the record
    @post.save